In [1]:
import pandas as pd

# Dataframe条件查询操作

## 注意：loc和query中可以跟多个条件，可以使用&（与）、|（或）表示条件之间的关系

## 加载scientists.csv数据集

In [3]:
scientists=pd.read_csv('./data(1)/scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

## 示例：获取Age大于60且Age<80的科学家信息

In [4]:
scientists.query('Age > 60 & Age < 80')

             Name        Born        Died  Age     Occupation
1  William Gosset  1876-06-13  1937-10-16   61   Statistician
3     Marie Curie  1867-11-07  1934-07-04   66        Chemist
7    Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

# DataFrame 分组聚合操作

 ## 示例：按照 Occupation 职业分组，并计算每组年龄的平均值

In [12]:
scientists.groupby('Occupation')['Age'].mean()

Occupation
Biologist             56.0
Chemist               51.5
Computer Scientist    41.0
Mathematician         77.0
Nurse                 90.0
Physician             45.0
Statistician          61.0
Name: Age, dtype: float64

In [14]:
scientists.groupby('Occupation').Age.mean()

Occupation
Biologist             56.0
Chemist               51.5
Computer Scientist    41.0
Mathematician         77.0
Nurse                 90.0
Physician             45.0
Statistician          61.0
Name: Age, dtype: float64

## 示例：按照 Occupation 职业分组，并计算每组的人数和年龄的平均值

In [15]:
scientists.groupby('Occupation').agg({'Name':'count','Age':'mean'})

                    Name   Age
Occupation
Biologist              1  56.0
Chemist                2  51.5
Computer Scientist     1  41.0
Mathematician          1  77.0
Nurse                  1  90.0
Physician              1  45.0
Statistician           1  61.0

In [16]:
scientists.groupby('Occupation').aggregate({'Name':'count','Age':'mean'})

                    Name   Age
Occupation
Biologist              1  56.0
Chemist                2  51.5
Computer Scientist     1  41.0
Mathematician          1  77.0
Nurse                  1  90.0
Physician              1  45.0
Statistician           1  61.0